# **Ing. Datos | Hugo Elias Márquez Diestra**

In [1]:
# Iniciar siempre
import pandas as pd

In [8]:
# Iniciar siempre x2
# Definimos el diccionario d2
d2 = { 'Estudiante': ['Juan', 'Carlos', 'Rosa', 'Jean', 'Lourdes', 'Mario'],
       'Edad':       [19,20,18,18,20,18],
       'Promedio':   [15,12,8,18,10,17],
       'Ciclo':      ['V', 'VI', 'V', 'IV', 'IX', 'V'],
       'Curso':      ['Ingenieria de Datos', 'Base de Datos', 'Algoritmos',              'Tesis', 'Proyecto de Tesis', 'Programación']
    }

# Convertimos el Diccionario a un DataFrame
DF2 = pd.DataFrame(d2)

# Mostramos los resultados
DF2

  Estudiante  Edad  Promedio Ciclo                Curso
0       Juan    19        15     V  Ingenieria de Datos
1     Carlos    20        12    VI        Base de Datos
2       Rosa    18         8     V           Algoritmos
3       Jean    18        18    IV                Tesis
4    Lourdes    20        10    IX    Proyecto de Tesis
5      Mario    18        17     V         Programación

#### Método head() | Devuelve las primeras filas del DataFrame

In [9]:
DF2.head()

  Estudiante  Edad  Promedio Ciclo                Curso
0       Juan    19        15     V  Ingenieria de Datos
1     Carlos    20        12    VI        Base de Datos
2       Rosa    18         8     V           Algoritmos
3       Jean    18        18    IV                Tesis
4    Lourdes    20        10    IX    Proyecto de Tesis

#### Método tail() | Devuelve las ultimas filas del DataFrame

In [10]:
DF2.tail(3)

  Estudiante  Edad  Promedio Ciclo              Curso
3       Jean    18        18    IV              Tesis
4    Lourdes    20        10    IX  Proyecto de Tesis
5      Mario    18        17     V       Programación

#### Método sample() | Muestra valores aleatorios del DataFrame

In [11]:
DF2.sample()

  Estudiante  Edad  Promedio Ciclo       Curso
2       Rosa    18         8     V  Algoritmos

In [13]:
DF2.sample(5)

  Estudiante  Edad  Promedio Ciclo                Curso
5      Mario    18        17     V         Programación
4    Lourdes    20        10    IX    Proyecto de Tesis
3       Jean    18        18    IV                Tesis
0       Juan    19        15     V  Ingenieria de Datos
2       Rosa    18         8     V           Algoritmos

#### Método info() | Muestra los nombres de las columnas, los tipo de datos y si tiene valores faltantes

In [14]:
DF2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Estudiante  6 non-null      object
 1   Edad        6 non-null      int64
 2   Promedio    6 non-null      int64
 3   Ciclo       6 non-null      object
 4   Curso       6 non-null      object
dtypes: int64(2), object(3)
memory usage: 372.0+ bytes

#### Método describe() | Calcula algunas estadisticas de resumen para las columnas numéricas, como la media, el valor máximo, el mínimo

In [15]:
DF2.describe()

            Edad   Promedio
count   6.000000   6.000000
mean   18.833333  13.333333
std     0.983192   3.983298
min    18.000000   8.000000
25%    18.000000  10.500000
50%    18.500000  13.500000
75%    19.750000  16.500000
max    20.000000  18.000000

#### Atributo shape | Atributo que devuelve el número de filas y columnas

In [16]:
DF2.shape

(6, 5)

#### Atributo columns | Devuelve el nombre de las columnas

In [17]:
DF2.columns

Index(['Estudiante', 'Edad', 'Promedio', 'Ciclo', 'Curso'], dtype='object')

#### Atributo index | Devuelve el indice de las filas ya sea números o nombres de las filas

In [18]:
DF2.index

RangeIndex(start=0, stop=6, step=1)

#### Atributo values | Devuelve una matriz bidimensional (Numpy 2D) de los valores

In [19]:
DF2.values

array([['Juan', 19, 15, 'V', 'Ingenieria de Datos'],
       ['Carlos', 20, 12, 'VI', 'Base de Datos'],
       ['Rosa', 18, 8, 'V', 'Algoritmos'],
       ['Jean', 18, 18, 'IV', 'Tesis'],
       ['Lourdes', 20, 10, 'IX', 'Proyecto de Tesis'],
       ['Mario', 18, 17, 'V', 'Programación']], dtype=object)

#### Método to_numpy | Se utiliza para convertir un DataFrame en un arreglo NumPy

In [20]:
DF2.to_numpy

<bound method DataFrame.to_numpy of   Estudiante  Edad  Promedio Ciclo                Curso
0       Juan    19        15     V  Ingenieria de Datos
1     Carlos    20        12    VI        Base de Datos
2       Rosa    18         8     V           Algoritmos
3       Jean    18        18    IV                Tesis
4    Lourdes    20        10    IX    Proyecto de Tesis
5      Mario    18        17     V         Programación>

# Eliminar Filas y Columnas

#### Método drop() | Elimina filas o columnas usando una etiqueta de índice o un nombre de columna.

##### Eliminar filas por etiquetas de filas

In [28]:
# Definimos el diccionario d
d = { 'Nombre':       ['Rosa', 'Juan', 'María', 'Pedro'],
      'ID':           [1, 2, 3, 4],
      'Departamento': ['Ventas', 'Logistica', 'Contabilidad', 'Sistemas'],
      'Sueldo': [1500, 2000, 2500, 3000]
    }

# Convertimos el Diccionario a un DataFrame
DF = pd.DataFrame(d)

# Mostramos los resultados
DF

  Nombre  ID  Departamento  Sueldo
0   Rosa   1        Ventas    1500
1   Juan   2     Logistica    2000
2  María   3  Contabilidad    2500
3  Pedro   4      Sistemas    3000

In [23]:
dfi = DF.set_index('Nombre')
dfi

        ID  Departamento  Sueldo
Nombre
Rosa     1        Ventas    1500
Juan     2     Logistica    2000
María    3  Contabilidad    2500
Pedro    4      Sistemas    3000

In [25]:
dfi.drop(['Juan','Pedro'], inplace=True)
dfi

        ID  Departamento  Sueldo
Nombre
Rosa     1        Ventas    1500
María    3  Contabilidad    2500

#### Eliminar columnas por el nombre de la columna

In [29]:
DF.drop(['ID','Departamento'], axis=1, inplace=True)
DF

  Nombre  Sueldo
0   Rosa    1500
1   Juan    2000
2  María    2500
3  Pedro    3000

# Iteración

### Método iterrows() | Tomar cada elemento del DataFrame, uno tras otro.

In [30]:
for i,j in DF.iterrows():
    print(i,j)
    print()

0 Nombre    Rosa
Sueldo    1500
Name: 0, dtype: object

1 Nombre    Juan
Sueldo    2000
Name: 1, dtype: object

2 Nombre    María
Sueldo     2500
Name: 2, dtype: object

3 Nombre    Pedro
Sueldo     3000
Name: 3, dtype: object